# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack' # grep https://beyondgrep.com/
brew 'act' # GitHub Actions https://github.com/nektos/act
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'cmake'
brew 'coreutils' # Those that come with macOS are outdated
brew 'diff-so-fancy' # Better diff https://github.com/so-fancy/diff-so-fancy
brew 'fzf' # Fuzzy finder https://github.com/junegunn/fzf
brew 'fd' # Better find https://github.com/sharkdp/fd
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'gawk'
brew 'gsed'
brew 'htop' # https://formulae.brew.sh/formula/htop
brew 'httpie'
brew 'hub'
brew 'lastpass-cli'
brew 'mackup'
brew 'monolith' # Backup a complete webpage https://github.com/Y2Z/monolith
brew 'mas' # Mac App Store manager
brew 'nvim'
brew 'fnm' # Node version switcher
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'prettyping' # http://denilson.sa.nom.br/prettyping/
brew 'redis'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wabt' # Web Assembly
brew 'wp-cli' # WordPress cli
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'deno'
brew 'rustup'
brew 'php'
brew 'composer'
brew 'gh'
brew 'git-flow'
brew 'imagemagick'
brew 'nginx'
brew 'node'
brew 'python'
brew 'pyenv'
brew 'redis'
brew 'starship'
brew 'yarn'

# Apps
cask 'aerial'
cask 'blender'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'godot'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'messenger'
cask 'sip'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-fira-code'

# Mac App Store
# mas 'Byword', id: 420212497
mas 'Keynote', id: 409183694
mas 'Lightshot Screenshot', id: 526298438
mas 'Trello', id: 1278508951
mas 'WireGuard', id: 1451685025
mas 'Bear', id: 1016366447
mas 'Daisy Disk', id: 411643860
