# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack' # grep https://beyondgrep.com/
brew 'act' # GitHub Actions https://github.com/nektos/act
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'cmake'
brew 'coreutils' # Those that come with macOS are outdated
brew 'duf' # better df https://github.com/muesli/duf
brew 'entr' # https://github.com/eradman/entr
brew 'exa' # ls replacement https://github.com/ogham/exa
brew 'fzf' # Fuzzy finder https://github.com/junegunn/fzf
brew 'fd' # Better find https://github.com/sharkdp/fd
brew 'git'
brew 'git-delta' # https://github.com/dandavison/delta
brew 'gnupg2'
brew 'grep'
brew 'gawk'
brew 'gsed'
brew 'htop' # https://formulae.brew.sh/formula/htop
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'less'
brew 'mackup'
brew 'monolith' # Backup a complete webpage https://github.com/Y2Z/monolith
brew 'mas' # Mac App Store manager
brew 'nvim'
brew 'fnm' # Node version switcher
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'prettyping' # http://denilson.sa.nom.br/prettyping/
brew 'pure' # https://github.com/sindresorhus/pure
brew 'redis'
brew 'ripgrep' # https://github.com/BurntSushi/ripgrep
brew 'sd' # sed alternative https://github.com/chmln/sd
brew 'thefuck' # https://github.com/nvbn/thefuck
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wabt' # Web Assembly
brew 'wp-cli' # WordPress cli
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zoxide'

# Development
brew 'deno'
brew 'rustup'
brew 'php'
brew 'composer'
brew 'dropbox'
brew 'gh'
brew 'imagemagick'
brew 'nginx'
brew 'node'
brew 'python'
brew 'pyenv'
brew 'starship'
brew 'wireshark'

# Apps
# cask 'applite'
cask 'blender'
cask 'cleanshot'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'godot'
cask 'google-chrome'
cask 'helo'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'nvidia-geforce-now'
cask 'ray'
cask 'raycast'
cask 'sip'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'
cask 'textual'
cask 'tinkerwell'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'warm'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-fira-code'

# Mac App Store
# mas 'Byword', id: 420212497
mas 'Daisy Disk', id: 411643860
